def is_strobogram_number(num: str) -> bool:
    res: str = ''
    strob_digit = '0689'
    for i in range(len(num) - 1, -1, -1):
        if num[i] in strob_digit:
            if num[i] == '6':
                res += '9'
            elif num[i] == '9':
                res += '6'
            else:
                res += num[i]
        else:
            return False
    return res == num


"""Тест для стробограмматическое число."""

"""Тест для числа, у которого все цифры стробограмматические, но само число не подходит под условие."""

"""Тест не стробограмматического числа."""

"""Тест для строки с буквами, а не числами."""

"""Тест проверяет обработку integer вместо string(такая ошибка возникнет при попытке итерации)."""

"""
Вопросы:
- нужна обработка входных данных? Раз есть условие, что подается строка с числом, я бы сделала только обработку ошибки) 
"""

