"""
Задание:
Дан массив отсортированных целых чисел, надо вернуть отсортированный массив квадратов этих чисел
"""

import unittest


def sqrt_array(int_array: list) -> str:
    """
    Функция принмает массив целых чисел. Если массив пустой, то он возвращается в ответе.
    Иначе используются указатели в начале и в конце массива, сравниваются квадраты чисел этих указателей.
    Итоговый массив заполняется с конца. В него записывается наибольший квадрат числа, а указатель этого числа смещается.
    Ключевые параметры:
    int_array - переданный массив
    left - левый указатель, указывает на первый элемент
    right - правый указатель, указывает на последний элемент
    sqrt_list - итоговый массив с квадратами чисел
    """
    array_len = len(int_array)
    left: int = 0
    right: int = array_len - 1
    sqrt_list = [0] * array_len

    if not int_array:
        return "Передан пустой массив. Итоговый массив: []."

    for i in range(array_len - 1, -1, -1):
        left_sqrt: int = int_array[left] ** 2
        right_sqrt: int = int_array[right] ** 2
        if left_sqrt > right_sqrt:
            sqrt_list[i] = left_sqrt
            left += 1
        else:
            sqrt_list[i] = right_sqrt
            right -= 1
    return f"Массив квадратов переданных чисел: {sqrt_list}."


"""
Позитивные тесты
"""

"""Тест проверяет работу с положительными числами."""
assert "Массив квадратов переданных чисел: [1, 4, 100, 625]." == sqrt_array(
    [1, 2, 10, 25]
)

"""Тест проверяет работу с отрицательными числами."""
assert "Массив квадратов переданных чисел: [9, 25, 64, 225]." == sqrt_array(
    [-15, -8, -5, -3]
)

"""Тест массива минимального размера, единственный элемент - ноль."""
assert "Массив квадратов переданных чисел: [0]." == sqrt_array([0])

"""Тест комбинированных данных. Содержит отрицательные и положительные числа, ноль, большое число с записью через нижнее подчеркивание и дубли чисел."""
assert (
    "Массив квадратов переданных чисел: [0, 1, 1, 25, 100, 100, 4611686014132420609]."
    == sqrt_array([-10, -1, 0, 1, 5, 10, 2_147_483_647])
)

"""Тест с одинаковыми числами."""
assert "Массив квадратов переданных чисел: [25, 25, 25]." == sqrt_array([-5, -5, -5])

"""Тест с одинаковыми по модулю, но разными по значению числами."""
assert "Массив квадратов переданных чисел: [25, 25, 25, 25]." == sqrt_array(
    [-5, -5, 5, 5]
)

"""
Критичные негативные тесты
"""

"""Тест проверяет, что для пустого массива вернется пустой массив."""
assert "Передан пустой массив. Итоговый массив: []." == sqrt_array([])

"""Тест необрабатываемого исключения, когда передан не массив."""


class TestNotList(unittest.TestCase):
    def test_not_list(self):
        with self.assertRaises(TypeError):
            sqrt_array(-5)


"""Тест необрабатываемого исключения, когда передан массив нечисловых элементов."""


class TestNotNumeric(unittest.TestCase):
    def test_not_numeric(self):
        with self.assertRaises(TypeError):
            sqrt_array(["-5", None, "", "word"])


"""
Остальные негативные тесты
"""

"""Тест неотсортированного массива с вещественными числами и научной нотацией. Вернется массив квадратов, но числа будут вещественными, а массив - неостортированным."""
assert "Массив квадратов переданных чисел: [9.8596, 10000.0]." == sqrt_array(
    [-3.14, 1e2]
)
